export default {
    ORDER_STATUS_DESC: {
        10: '未预约',
        20: '已预约完成',
        30: '已签到',
        33: '正在量房',
        35: '量房完成',
        40: '已上传需求清单',
        50: '已报价',
        60: '已签约',
        70: '已开工',
        80: '已完工',
        90: '已验收',
        100: '已完成',
        999: '已关闭',
    },

    IMG_TYPE_DESC: {
        1: '现场图片',
        2: '需求清单图片',
        3: '户型图片',
        4: '微信群截图片',
        5: '报价完成前需求变更图片',
        6: '报价完成后需求变更图片',
        7: '项目变更图片',
        8: '微信完工证据图片',
        9: '大众点评证据图片',
        10: '验收项目评价表图片',
        11: '验收现场图片',
    },

    MATERIAL_PASTE_DESC: {
        0: '合格',
        1: '不合格'
    },

    DISMANTLE_DELIVER_DESC: {
        0: '无拆旧',
        1: '有拆旧未完成',
        2: '完成拆旧交底',
    },

    PROTECTIVE_FILM_PASTE: {
        0: '保护合格',
        1: '保护不合格需要整改',
        2: '保护未完全需要工厂反馈',
    },

    DAILY_SCHEDULE_DESC: {
        1: '正常',
        2: '工期紧张',
        3: '工期延后',
    },

    DAILY_TYPE_DESC: {
        1: '今日工作内容',
        2: '明日工作计划',
    },

    INSPECTION_TYPE_DESC: {
        0: '重要节点检查',
        1: '日常施工检查',
        2: '问题处理'
    },

    INSPECTION_POINT_TYPE_DESC: {
        0: '水电隐蔽验收',
        1: '铲墙处理验收',
        2: '蓄水试验验收',
        3: '拆就结束验收',
    },

    INSPECTION_QUALITY_DESC: {
        0: '施工质量合格',
        1: '施工存在问题'
    },

    INSPECTION_PROTECT_DESC: {
        0: '保护正常',
        1: '保护不合格，需要整改',
        2: '保护损坏，需要修复',
    },

    INSPECTION_HEALTH_DESC: {
        0: '卫生合格',
        1: '卫生不合格'
    },

    INSPECTION_PROGRESS_DESC: {
        0: '符合日报',
        1: '与日报不符'
    },

    PROBLEM_STATUS_DESC: {
        1: '正在处理问题',
        2: '问题处理完毕'
    }
}